test/stripe/invoice_deleted.json

{
    "id": "evt_abc",
    "object": "event",
    "api_version": "2020-08-27",
    "created": 1689634585,
    "data": {
      "object": {
        "id": "in_xyz",
        "object": "invoice",
        "account_country": "SG",
        "account_name": "Supabase Pte Ltd",
        "account_tax_ids": null,
        "amount_due": 0,
        "amount_paid": 0,
        "amount_remaining": 0,
        "amount_shipping": 0,
        "application": null,
        "application_fee_amount": null,
        "attempt_count": 0,
        "attempted": false,
        "auto_advance": false,
        "automatic_tax": {
          "enabled": false,
          "status": null
        },
        "billing_reason": "manual",
        "charge": null,
        "collection_method": "send_invoice",
        "created": 1689632642,
        "currency": "usd",
        "custom_fields": null,
        "customer": "cus_123",
        "customer_address": null,
        "customer_email": "some.email@gmail.com",
        "customer_name": "asd",
        "customer_phone": null,
        "customer_shipping": null,
        "customer_tax_exempt": "none",
        "customer_tax_ids": [
        ],
        "default_payment_method": null,
        "default_source": null,
        "default_tax_rates": [
        ],
        "description": null,
        "discount": null,
        "discounts": [
        ],
        "due_date": 1692224642,
        "effective_at": null,
        "ending_balance": null,
        "footer": "All prices are GST inclusive\nSingapore GST No: 202005760H",
        "from_invoice": null,
        "hosted_invoice_url": null,
        "invoice_pdf": null,
        "last_finalization_error": null,
        "latest_revision": null,
        "lines": {
          "object": "list",
          "data": [
            {
              "id": "il_1",
              "object": "line_item",
              "amount": 1000,
              "amount_excluding_tax": 1000,
              "currency": "usd",
              "description": "something",
              "discount_amounts": [
              ],
              "discountable": true,
              "discounts": [
              ],
              "invoice_item": "li_1",
              "livemode": false,
              "metadata": {
              },
              "period": {
                "end": 1689632651,
                "start": 1689632651
              },
              "plan": null,
              "price": {
                "id": "price_1",
                "object": "price",
                "active": false,
                "billing_scheme": "per_unit",
                "created": 1689632651,
                "currency": "usd",
                "custom_unit_amount": null,
                "livemode": false,
                "lookup_key": null,
                "metadata": {
                },
                "nickname": null,
                "product": "prod_OHY",
                "recurring": null,
                "tax_behavior": "unspecified",
                "tiers_mode": null,
                "transform_quantity": null,
                "type": "one_time",
                "unit_amount": 1000,
                "unit_amount_decimal": "1000"
              },
              "proration": false,
              "proration_details": {
                "credited_items": null
              },
              "quantity": 1,
              "subscription": null,
              "tax_amounts": [
              ],
              "tax_rates": [
              ],
              "type": "invoiceitem",
              "unit_amount_excluding_tax": "1000"
            }
          ],
          "has_more": false,
          "total_count": 1,
          "url": "/v1/invoices/in_xyz/lines"
        },
        "livemode": false,
        "metadata": {
        },
        "next_payment_attempt": null,
        "number": null,
        "on_behalf_of": null,
        "paid": false,
        "paid_out_of_band": false,
        "payment_intent": null,
        "payment_settings": {
          "default_mandate": null,
          "payment_method_options": null,
          "payment_method_types": null
        },
        "period_end": 1692311004,
        "period_start": 1689632604,
        "post_payment_credit_notes_amount": 0,
        "pre_payment_credit_notes_amount": 0,
        "quote": null,
        "receipt_number": null,
        "rendering_options": null,
        "shipping_cost": null,
        "shipping_details": null,
        "starting_balance": -51315,
        "statement_descriptor": null,
        "status": "deleted",
        "status_transitions": {
          "finalized_at": null,
          "marked_uncollectible_at": null,
          "paid_at": null,
          "voided_at": null
        },
        "subscription": null,
        "subtotal": 1000,
        "subtotal_excluding_tax": 1000,
        "tax": null,
        "test_clock": null,
        "total": 1000,
        "total_discount_amounts": [
        ],
        "total_excluding_tax": 1000,
        "total_tax_amounts": [
        ],
        "transfer_data": null,
        "webhooks_delivered_at": 1689632644
      }
    },
    "livemode": false,
    "pending_webhooks": 1,
    "request": {
      "id": "req_sF",
      "idempotency_key": null
    },
    "type": "invoice.deleted"
  }