test/stripe/invoice_paid.json

{
  "id": "evt_1IybXDJDPojXS6LNQdMK9k5R",
  "object": "event",
  "api_version": "2020-03-02",
  "created": 1622807394,
  "data": {
    "object": {
      "id": "in_1IybXCJDPojXS6LNsTXT2XTE",
      "object": "invoice",
      "account_country": "SG",
      "account_name": "Supabase",
      "account_tax_ids": null,
      "amount_due": 0,
      "amount_paid": 0,
      "amount_remaining": 0,
      "application_fee_amount": null,
      "attempt_count": 0,
      "attempted": true,
      "auto_advance": false,
      "billing_reason": "subscription_create",
      "charge": null,
      "collection_method": "charge_automatically",
      "created": 1622807394,
      "currency": "usd",
      "custom_fields": null,
      "customer": "cus_In8hNR2sjxGIgG",
      "customer_address": null,
      "customer_email": null,
      "customer_name": null,
      "customer_phone": null,
      "customer_shipping": null,
      "customer_tax_exempt": "none",
      "customer_tax_ids": [],
      "default_payment_method": null,
      "default_source": null,
      "default_tax_rates": [],
      "description": null,
      "discount": null,
      "discounts": [],
      "due_date": null,
      "ending_balance": 0,
      "footer": null,
      "hosted_invoice_url": "https://invoice.stripe.com/i/acct_1GThseJDPojXS6LN/invst_JbpBCAha1NYzlzNBeCSc24aXqQgyQIS",
      "invoice_pdf": "https://pay.stripe.com/invoice/acct_1GThseJDPojXS6LN/invst_JbpBCAha1NYzlzNBeCSc24aXqQgyQIS/pdf",
      "last_finalization_error": null,
      "lines": {
        "object": "list",
        "data": [
          {
            "id": "il_1IybXCJDPojXS6LNEJx96F0g",
            "object": "line_item",
            "amount": 0,
            "currency": "usd",
            "description": "1 × Free tier (at $0.00 / month)",
            "discount_amounts": [],
            "discountable": true,
            "discounts": [],
            "livemode": false,
            "metadata": {
              "project_id": "303",
              "project_ref": "pplknxhoipignmgtpvqq",
              "project_name": "stripe webhooks",
              "organization_id": "18",
              "organization_slug": "distinct-beige-cat"
            },
            "period": {
              "end": 1625399394,
              "start": 1622807394
            },
            "plan": {
              "id": "price_1IDQm5JDPojXS6LNM31hxKzp",
              "object": "plan",
              "active": true,
              "aggregate_usage": null,
              "amount": 0,
              "amount_decimal": "0",
              "billing_scheme": "per_unit",
              "created": 1611564617,
              "currency": "usd",
              "interval": "month",
              "interval_count": 1,
              "livemode": false,
              "metadata": {},
              "nickname": null,
              "product": "prod_Ip4vqwv3EJ7Mi0",
              "tiers": null,
              "tiers_mode": null,
              "transform_usage": null,
              "trial_period_days": null,
              "usage_type": "licensed"
            },
            "price": {
              "id": "price_1IDQm5JDPojXS6LNM31hxKzp",
              "object": "price",
              "active": true,
              "billing_scheme": "per_unit",
              "created": 1611564617,
              "currency": "usd",
              "livemode": false,
              "lookup_key": null,
              "metadata": {},
              "nickname": null,
              "product": "prod_Ip4vqwv3EJ7Mi0",
              "recurring": {
                "aggregate_usage": null,
                "interval": "month",
                "interval_count": 1,
                "trial_period_days": null,
                "usage_type": "licensed"
              },
              "tiers_mode": null,
              "transform_quantity": null,
              "type": "recurring",
              "unit_amount": 0,
              "unit_amount_decimal": "0"
            },
            "proration": false,
            "quantity": 1,
            "subscription": "sub_JbpBbyTnwwDuSH",
            "subscription_item": "si_JbpB6V1sXv4B9A",
            "tax_amounts": [],
            "tax_rates": [],
            "type": "subscription"
          }
        ],
        "has_more": false,
        "total_count": 1,
        "url": "/v1/invoices/in_1IybXCJDPojXS6LNsTXT2XTE/lines"
      },
      "livemode": false,
      "metadata": {},
      "next_payment_attempt": null,
      "number": "F061AB46-0011",
      "on_behalf_of": null,
      "paid": true,
      "payment_intent": null,
      "payment_settings": {
        "payment_method_options": null,
        "payment_method_types": null
      },
      "period_end": 1622807394,
      "period_start": 1622807394,
      "post_payment_credit_notes_amount": 0,
      "pre_payment_credit_notes_amount": 0,
      "receipt_number": null,
      "starting_balance": 0,
      "statement_descriptor": null,
      "status": "paid",
      "status_transitions": {
        "finalized_at": 1622807394,
        "marked_uncollectible_at": null,
        "paid_at": 1622807394,
        "voided_at": null
      },
      "subscription": "sub_JbpBbyTnwwDuSH",
      "subtotal": 0,
      "tax": null,
      "tax_percent": null,
      "total": 0,
      "total_discount_amounts": [],
      "total_tax_amounts": [],
      "transfer_data": null,
      "webhooks_delivered_at": null
    }
  },
  "livemode": false,
  "pending_webhooks": 2,
  "request": {
    "id": "req_6b9b9Z6HxsgpdR",
    "idempotency_key": null
  },
  "type": "invoice.paid"
}
